# 层次化索引

In [2]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

In [3]:
data = Series(np.random.randn(10),
             index = [['a','a','a','b','b','b','c','c','d','d'],
                     [1,2,3,1,2,3,1,2,1,2]])

In [4]:
data

a  1   -0.358138
   2   -1.223805
   3   -0.552421
b  1    0.742945
   2   -1.598487
   3    1.514173
c  1    1.295628
   2    0.492741
d  1   -0.180455
   2    0.743500
dtype: float64

In [5]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 0, 1]])

In [6]:
data['b']

1    0.742945
2   -1.598487
3    1.514173
dtype: float64

In [7]:

data['b':'c']

b  1    0.742945
   2   -1.598487
   3    1.514173
c  1    1.295628
   2    0.492741
dtype: float64

In [8]:
data.ix[['b','d']]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b  1    0.742945
   2   -1.598487
   3    1.514173
d  1   -0.180455
   2    0.743500
dtype: float64

In [10]:
# 内层选取
data[:,2]

a   -1.223805
b   -1.598487
c    0.492741
d    0.743500
dtype: float64

In [11]:
# 通过unstack方法安排到一个DataFrame中
data.unstack()

          1         2         3
a -0.358138 -1.223805 -0.552421
b  0.742945 -1.598487  1.514173
c  1.295628  0.492741       NaN
d -0.180455  0.743500       NaN

In [12]:
# unstack的逆运算是stack
data.unstack().stack()

a  1   -0.358138
   2   -1.223805
   3   -0.552421
b  1    0.742945
   2   -1.598487
   3    1.514173
c  1    1.295628
   2    0.492741
d  1   -0.180455
   2    0.743500
dtype: float64

In [13]:
# 对于一个DataFrame每一条轴上都可以有分层索引
frame = DataFrame(np.arange(12).reshape((4,3)),
                 index = [['a','a','b','b'],[1,2,1,2]],
                 columns=[['Ohio','Ohio','Colorado'],
                         ['Green','Red','Green']])

In [14]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [15]:
frame.index.names = ['key1','key2']

In [16]:
frame.columns.names = ['state','color']

In [17]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [18]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

## 重排分级顺序

In [20]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [21]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [22]:
frame.sortlevel(1)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [23]:
frame.swaplevel(0,1).sortlevel(0)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

## 根据级别汇总统计m

In [25]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [26]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

## 使用DataFrame的列

In [27]:
frame = DataFrame({'a':range(7),'b':range(7,0,-1),
                  'c':['one','one','one','two','two','two','two'],
                  'd':[0,1,2,0,1,2,3]})

In [28]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [29]:
# set_insex函数会将一个或多个列转换为行索引
frame2 = frame.set_index(['c','d'])

In [30]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [31]:
# 默认情况会删除列，也可以不删除
frame.set_index(['c','d'],drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [32]:
#reset_index的功能与上面相反
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1